Repository: marcosjunqueira/sonar-l10n-pt-omegat
Catalog: tm/db-omegat.tmx
Source language: en_us
Languages: pt_br

source: unable to locate type {0} in: {1}
pt_br: incapaz de localizar tipo {0} em: {1}

source: Unable to format command:
pt_br: Incapaz de formatar comando:

source: Unable to execute command:
pt_br: Incapaz de executar comando:

source: unable bind type {0}, table: {1}
pt_br: incapaz de localizar tipo {0}, tabela: {1}

source: no connection available
pt_br: nenhuma conexão disponível

source: no database metadata available
pt_br: metadado de banco de dados indisponível

source: Fully qualified table name required.
pt_br: Obrigatório o nome totalmente qualidade da tabela.

source: Database schema not found.
pt_br: Esquema do banco de dados não localizado.

source: Retrieving database schema ...
pt_br: Retornando o esquema do banco de dados ...

source: Cannot retrieve database schema.
pt_br: Não retornar o esquema do banco de dados.

source: Unable to set tables to null.
pt_br: Incapaz de atribuir nulo para as tabelas.

source: Unable to set index columns to null.
pt_br: Incapaz de atribuir nulo para as colunas índice.

source: {0} database schema was captured by previous version of database schema module and is not compatible with current version.
pt_br: O esquema {0} do banco de dados foi capturado por uma versão anterior do módulo esquema do banco de dados e não é compatível com a versão corrente.

source: Database Schema (JDBC Implementation)
pt_br: Esquema do Banco de Dados (Implementação JDBC)

source: Enables you to capture and view the structure of a database in the IDE.
pt_br: Permite capturar e visualizar a estrutura do banco de dados no IDE.

source: Enables you to create a database structure snapshot that you can use in the IDE.
pt_br: Permite criar um snapshot da estrutura do banco de dados que pode ser utilizado no IDE.

source: Database Schema Module Help
pt_br: Ajuda do Módulo do Esquema do Banco de Dados

source: Templates for creating various types of database files and applications.
pt_br: Modelos para a criação de vários tipos de arquivos e aplicações do banco de dados.

source: Creates a new persistent database schema file.
pt_br: Cria um novo arquivo de esquema de banco de dados persistente.

source: < No connection >
pt_br: < Não conectado >

source: < No template >
pt_br: < Nenhum template >

source: < No schema >
pt_br: < Nenhum esquema >

source: < Select from the list >
pt_br: < Selecione a partir da lista >

source: Provide connection information for the database from which you want to capture the schema.
pt_br: Fornece informação de conexão para o banco de dados que deseja capturar o esquema.

source: Either choose an existing database connection, or give details for creating a new connection.
pt_br: Escolha uma conexão com um banco de dados existente, ou forneça detalhes para criação de uma nova conexão.

source: List of the available schemas.
pt_br: Lista dos esquemas disponíveis.

source: Select the schema you want to use.
pt_br: Selecione o esquema que deseja utilizar.

source: Unable to get the list of the database schemas.
pt_br: Incapaz de recuperar a lista de esquemas do banco de dados.

source: The database connection failed because:
pt_br: A conexão com o banco de dados falhou por que:

source: You probably entered an incorrect database URL, username or password.
pt_br: Você provavelmente informou uma URL de banco de dados, usuário ou senha incorreta.

source: Connection panel.
pt_br: Painel de conexão.

source: Connection panel description
pt_br: Descrição do painel de conexão

source: Existing connections combo box
pt_br: Combo box com as conexões existentes

source: Select this option to choose from existing connections.
pt_br: Selecione esta opção para escolher a partir de conexões existentes.

source: Existing connection combo box
pt_br: Combo box com conexão existente

source: Combo box containing all existing database connections.
pt_br: Combo box contendo todas as conexões de banco de dados existentes.

source: Capturing Database Schema - NetBeans
pt_br: Capturando o Esquema do Banco de Dados - NetBeans

source: Schema capture 0% complete
pt_br: Captura do esquema 0% completa

source: Preparing to capture database schema ...
pt_br: Preparando para capturar o esquema do banco de dados ...

source: Capturing keys for {0} {1}
pt_br: Capturando chaves para {0} {1}

source: table
pt_br: tabela

source: view
pt_br: visão

source: Schema capture {0}% complete
pt_br: Captura de esquema {0}% completo

source: Schema capture complete: {0} tables and views captured.
pt_br: Captura do esquema completp: {0} tabelas e visões capturadas.

source: Press this button to cancel the capturing of the database schema.
pt_br: Pressione este botão para cancelar a captura do esquema do banco de dados.

source: Capturing database schema progress dialog.
pt_br: Janela de progresso de captura do esquema do banco de dados.

source: Unable to close connection.
pt_br: Incapaz de fechar conexão.

source: Recapture Schema from Database
pt_br: Recaptura do Esquema do Banco de Dados

source: Capture Database Schema Wizard
pt_br: Assistente para Captura do Esquema do Banco de Dados

source: Connecting to database ...
pt_br: Conectando no banco de dados ...

source: Creating database schema ...
pt_br: Criando esquema do banco de dados ...

source: Saving database schema ...
pt_br: Salvando esquema do banco de dados ...

source: Capturing {0} table
pt_br: Capturando tabela {0}

source: Capturing {0} view
pt_br: Capturando visão {0}

source: Database schema successfully created and saved.
pt_br: Esquema do banco de dados criado e salvo com sucesso.

source: Unable to create database schema - {0}.
pt_br: Incapaz de criar o esquema de banco de dados - {0}.

source: Database Schema Objects
pt_br: Objetos do Esquema de Banco de Dados

source: Name and Location
pt_br: Nome e Local

source: New Object Name
pt_br: Novo Nome de Objeto

source: Tables and Views
pt_br: Tabelas e Visões

source: Available &Tables and Views:
pt_br: &Tabelas e Visões Disponíveis:

source: &Selected Tables and Views:
pt_br: Tabelas e Visões &Selecionadas:

source: &Add >
pt_br: &Adicionar >

source: < &Remove
pt_br: < &Remover

source: Add A&ll >>
pt_br: Adicionar T&odos >>

source: << Remo&ve All
pt_br: << Remo&ver Todos

source: Note: All referenced tables will be captured automatically.
pt_br: Nota: Todas as tabelas referenciadas serão capturadas automaticamente.

source: Tables and views panel.
pt_br: Painel de tabelas e visões.

source: List of all available tables and views.
pt_br: Lista de todas tabelas e visões disponíveis.

source: All table/view list
pt_br: Lista de todas tabelas/views

source: List of selected tables and views.
pt_br: Lista das tabelas e visões selecionadas.

source: Selected table/view list
pt_br: Lista de tabelas/views selecionadas

source: Add table or view.
pt_br: Adicionar tabela ou visão.

source: Remove table or view.
pt_br: Remover tabela ou visão.

source: Add all tables and views.
pt_br: Adicionar todas tabelas e visões.

source: Remove all tables and views.
pt_br: Remover todas tabelas e visões.

source: Persistence
pt_br: Persistência

source: Database Schema
pt_br: Esquema do Banco de Dados

source: The connection to the database could not be established.
pt_br: A conexão com o banco de dados não pode ser completada.

source: Please Wait
pt_br: Por favor Aguarde

source: Closing the previous connection
pt_br: Fechando as conexões anteriores

source: Checking the existing connection
pt_br: Checando a conexão existente

source: Retrieving the tables
pt_br: Retornando as tabelas

source: Foreign Keys
pt_br: Chaves estrangeiras

source: Nullable
pt_br: Nulo

source: Length
pt_br: Tamanho

source: Precision
pt_br: Precisão

source: Database Product Name
pt_br: Nome do Produto do Banco de Dados

source: Database Product Version
pt_br: Versão do Produto do Banco de Dados

source: Driver Name
pt_br: Nome do Driver

source: Driver Version
pt_br: Versão do Driver

source: Username
pt_br: Nome do usuário

source: Local Column
pt_br: Coluna Local

source: Referenced Column
pt_br: Coluna Referenciada

source: Name of this element.
pt_br: Nome deste elemento.

source: Value type of this column.
pt_br: Tipo de valor desta coluna.

source: Is NULL allowed?
pt_br: NULL é permitido?

source: Value length of this column.
pt_br: Valor do tamanho desta coluna.

source: Value precision of this column.
pt_br: Valor da precisão desta coluna.

source: Value scale of this column.
pt_br: Valor da escala desta coluna.

source: Is this element table or view?
pt_br: Este elemento é tabela ou visão?

source: Is this index unique?
pt_br: Este índice é unico ?

source: Name of the schema
pt_br: Nome do esquema

source: Name of the catalog
pt_br: Nome do catálogo

source: Product name of the database
pt_br: Nome do produto do banco de dados

source: Version of the database
pt_br: Versão do banco de dados

source: Name of the JDBC driver
pt_br: Nome do driver JDBC

source: Version of the JDBC driver
pt_br: Versão do driver JDBC

source: Driver class
pt_br: Classe do Driver

source: URL of the database
pt_br: URL do banco de dados

source: Name of the local column of the foreign key.
pt_br: Nome da coluna local da chave estrangeira.

source: Name of the referenced column of the foreign key.
pt_br: Nome da coluna referenciada da chave estrangeira.

source: Cannot modify a read-only property.
pt_br: Não pode modificar propriedade somente leitura.

source: wait...
pt_br: aguarde...

source: error...
pt_br: erro...

source: Database Drivers
pt_br: Drivers do Banco de Dados

source: JDBC database drivers
pt_br: Drivers JDBC do banco de dados

source: <html>This plugin provides JDBC database drivers for an improved out-of-the-box experience when developing database applications.
pt_br: <html>Este plugin fornecer drivers JDBC para promover funcionalidades adicionais no desenvolvimento de aplicações de banco de dados.

source: <p>The following drivers are included in this plugin: <ul> <li>MySQL Connector/J Version: 5.0.7</li> <li>PostgreSQL JDBC 3 Driver Version: 8.2-506</li> </ul> </p></html>
pt_br: <p>Os drivers seguinte são inclusos neste plugin: <ul> <li>MySQL Connector/J Version: 5.0.7</li> <li>PostgreSQL JDBC 3 Driver Version: 8.2-506</li> </ul> </p></html>

source: Provides out of the box experience features for the Java DB database, such as starting/stopping the database server, or creating a new database.
pt_br: Fornece funcionalidades adicionais para o banco de dados Java DB, como inicialização/paralização do servidor de banco de dados, ou a criação de novo banco de dados.

source: Java DB Database Support
pt_br: Suporte ao Banco de Dados Java DB

source: Integration with the Java DB database.
pt_br: Integração com o banco de dados Java DB.

source: Java DB Database
pt_br: Banco de dados Java DB

source: Java DB Database Process
pt_br: Processo do Banco de Dados Java DB

source: Java D&B Database
pt_br: Banco de dados Java D&B

source: &Start Server
pt_br: Inicializar servidor

source: Sto&p Server
pt_br: &Parar servidor

source: &Create Database...
pt_br: &Criar banco de dados...

source: Se&ttings...
pt_br: Con&figurações...

source: Create Java DB Database
pt_br: Criar Banco de dados Java DB

source: Java DB Settings
pt_br: Configurações Java DB

source: Creating Java DB database {0}
pt_br: Criando banco de dados Java DB {0}

source: ERROR: The java executable was not found
pt_br: ERRO: O executável java não foi encontrado

source: Java DB Properties File
pt_br: Arquivo de Propriedades do Java DB

source: The Java DB location is not set correctly.
pt_br: O local do Java DB não está parametrizada corretamente.

source: Starting the Java DB Server
pt_br: Iniciando o Servidor Java DB

source: An error occurred while creating the database: {0}.
pt_br: Ocorreu um erro durante criação do banco de dados: {0}.

source: The Java DB server did not start in {0} seconds.
pt_br: O servidor Java DB não iniciou em {0} segundos.

source: Do you want to wait another {0} seconds?
pt_br: Você deseja aguardar mais {0} segundos?

source: Java DB Location
pt_br: Local do Java DB

source: The directory where the installation of the Java DB database is located.
pt_br: O diretório onde a instalação do banco de dados Java DB esta localizado.

source: Database Location
pt_br: Local do Banco de Dados

source: The directory where the Java DB databases are located.
pt_br: O diretório onde os bancos de dados Java DB estão localizados.

source: The directory entered here will be used as the value of the derby.system.home property.
pt_br: O diretório informado aqui será utilizado como valor para a propriedade derby.system.home.

source: The directory {0} does not contain a Java DB location.
pt_br: O diretório {0} não contém um local com Java DB.

source: The directory {0} does not exist.
pt_br: O diretório {0} não existe.

source: The directory {0} is not writable.
pt_br: O diretório {0} é protegido contra escrita.

source: Registering the Java DB database.
pt_br: Registrando o banco de dados Java DB.

source: The Java DB database installation was not found in your copy of NetBeans.
pt_br: A instalação do banco de dados Java DB não foi localizado na sua cópia do NetBeans.

source: Choose a name for the new database.
pt_br: Escolha um nome para o novo banco de dados.

source: Specify the name of the new database.
pt_br: Especifique o nome para o novo banco de dados.

source: A database with the selected name already exists.
pt_br: Já existe um banco de dados com o nome selecionado.

source: Database &Name:
pt_br: Banco de dados &Nome:

source: &Browse...
pt_br: &Localizar...

source: B&rowse...
pt_br: L&ocalizar...

source: Database &Location:
pt_br: Local do &Banco de Dados

source: Settings...
pt_br: Configurações...

source: The database name is empty.
pt_br: O nome do banco de dados está vazio.

source: The database name cannot contain {0} characters.
pt_br: O nome do banco de dados não pode conter caracteres {0}.

source: The database location already contains a file named {0}.
pt_br: O local do banco de dados já contém um arquivo nomeado {0}.

source: Warning: It is recommended you enter an user name and password.
pt_br: Cuidado: É recomendado você informar o nome do usuário e a senha.

source: Warning: The character {0} may be unsupported in a database name.
pt_br: Cuidado: O caracter {0} talvez não seja suportado como nome do banco de dados.

source: Enter the database location.
pt_br: Informe o local do banco de dados.

source: The specified database location is not a directory.
pt_br: O local do banco de dados especificado não é um diretório.

source: The specified database location is not an absolute path.
pt_br: O local do banco de dados especificado não é um caminho absoluto.

source: An error occurred while creating the specified database location.
pt_br: Ocorreu um erro durante a criação do local do banco de dados.

source: The directory where you will keep your databases
pt_br: O diretório onde será armazenado os seus bancos de dados

source: Browse for the directory where you will keep your databases.
pt_br: Navegue para o diretório onde será mantidos seus bancos de dados.

source: Set Database Location
pt_br: Configure o Local do Banco de Dados

source: Database Name
pt_br: Nome do Banco de Dados

source: User Name
pt_br: Nome do Usuário

source: Password
pt_br: Senha

source: Java DB Installation:
pt_br: Instalação do Java BD:

source: Specify the folder where Java DB is installed and the folder where you will keep your databases.
pt_br: Especifique a pasta onde o Java BD está instalado e a pasta onde serão mantidos seus bancos de dados.

source: The database location folder will be used as the value of the derby.system.home property.
pt_br: O local da pasta do banco de dados será utilizado como valor para a propriedade derby.system.home.
